---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalFileUtils
source: html/e991de74-3837-b9de-310d-06ea183c1bac.htm
---
# ExternalFileUtils Methods

Gets the ids of all elements which are external file references.